#### Terraform Format and Style for "test" `success`
#### Terraform Initialization ⚙️`success`
#### Terraform Validation 🤖`success`
#### Terraform Plan 📖`success`
<details><summary>Show Plan</summary>
```

terraform

Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
  + create

Terraform will perform the following actions:

  # module.vpc.aws_default_security_group.default[0] will be created
  + resource "aws_default_security_group" "default" {
      + arn                    = (known after apply)
      + description            = (known after apply)
      + egress                 = (known after apply)
      + id                     = (known after apply)
      + ingress                = (known after apply)
      + name                   = (known after apply)
      + name_prefix            = (known after apply)
      + owner_id               = (known after apply)
      + revoke_rules_on_delete = false
      + tags                   = {
          + "Environment" = "example"
          + "Managedby"   = "hello@clouddrove.com"
          + "Name"        = "vpc-example-default-sg"
          + "Repository"  = "https://github.com/clouddrove/terraform-aws-vpc"
        }
      + tags_all               = {
          + "Environment" = "example"
          + "Managedby"   = "hello@clouddrove.com"
          + "Name"        = "vpc-example-default-sg"
          + "Repository"  = "https://github.com/clouddrove/terraform-aws-vpc"
        }
      + vpc_id                 = (known after apply)
    }

  # module.vpc.aws_internet_gateway.default[0] will be created
  + resource "aws_internet_gateway" "default" {
      + arn      = (known after apply)
      + id       = (known after apply)
      + owner_id = (known after apply)
      + tags     = {
          + "Environment" = "example"
          + "Managedby"   = "hello@clouddrove.com"
          + "Name"        = "vpc-example-igw"
          + "Repository"  = "https://github.com/clouddrove/terraform-aws-vpc"
        }
      + tags_all = {
          + "Environment" = "example"
          + "Managedby"   = "hello@clouddrove.com"
          + "Name"        = "vpc-example-igw"
          + "Repository"  = "https://github.com/clouddrove/terraform-aws-vpc"
        }
      + vpc_id   = (known after apply)
    }

  # module.vpc.aws_vpc.default[0] will be created
  + resource "aws_vpc" "default" {
      + arn                                  = (known after apply)
      + assign_generated_ipv6_cidr_block     = true
      + cidr_block                           = "10.0.0.0/16"
      + default_network_acl_id               = (known after apply)
      + default_route_table_id               = (known after apply)
      + default_security_group_id            = (known after apply)
      + dhcp_options_id                      = (known after apply)
      + enable_classiclink                   = false
      + enable_classiclink_dns_support       = false
      + enable_dns_hostnames                 = true
      + enable_dns_support                   = true
      + enable_network_address_usage_metrics = (known after apply)
      + id                                   = (known after apply)
      + instance_tenancy                     = "default"
      + ipv6_association_id                  = (known after apply)
      + ipv6_cidr_block                      = (known after apply)
      + ipv6_cidr_block_network_border_group = (known after apply)
      + main_route_table_id                  = (known after apply)
      + owner_id                             = (known after apply)
      + tags                                 = {
          + "Environment" = "example"
          + "Managedby"   = "hello@clouddrove.com"
          + "Name"        = "vpc-example"
          + "Repository"  = "https://github.com/clouddrove/terraform-aws-vpc"
        }
      + tags_all                             = {
          + "Environment" = "example"
          + "Managedby"   = "hello@clouddrove.com"
          + "Name"        = "vpc-example"
          + "Repository"  = "https://github.com/clouddrove/terraform-aws-vpc"
        }
    }

  # module.vpc.aws_vpc_ipv4_cidr_block_association.secondary_cidr["172.2.0.0/16"] will be created
  + resource "aws_vpc_ipv4_cidr_block_association" "secondary_cidr" {
      + cidr_block = "172.2.0.0/16"
      + id         = (known after apply)
      + vpc_id     = (known after apply)
    }

  # module.vpc.aws_vpc_ipv4_cidr_block_association.secondary_cidr["172.3.0.0/16"] will be created
  + resource "aws_vpc_ipv4_cidr_block_association" "secondary_cidr" {
      + cidr_block = "172.3.0.0/16"
      + id         = (known after apply)
      + vpc_id     = (known after apply)
    }

Plan: 5 to add, 0 to change, 0 to destroy.

Changes to Outputs:
  + id   = [
      + (known after apply),
    ]
  + tags = [
      + {
          + Environment = "example"
          + Managedby   = "hello@clouddrove.com"
          + Name        = "vpc-example"
          + Repository  = "https://github.com/clouddrove/terraform-aws-vpc"
        },
    ]

Warning: Argument is deprecated

  with module.vpc.aws_vpc.default[0],
  on ../main.tf line 29, in resource "aws_vpc" "default":
  29:   enable_classiclink               = var.enable_classiclink

With the retirement of EC2-Classic the enable_classiclink attribute has been
deprecated and will be removed in a future version.

(and one more similar warning elsewhere)

─────────────────────────────────────────────────────────────────────────────

Note: You didn't use the -out option to save this plan, so Terraform can't
guarantee to take exactly these actions if you run "terraform apply" now.

```
</details>
*Pusher: @anmolnagpal, Action: `pull_request`*